blog-posts/2008-07-26-emacs-is-not-just-for-computer-geeks-also-these-are-the-things-that-keep-me-going.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs is not just for computer geeks; also, these are the things that</title>
<!-- 2014-04-30 Wed 17:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs is not just for computer geeks; also, these are the things that</h1>
<p>
keep me going
</p>

<p>
July 26th, 2008 -
<a href="http://sachachua.com/blog/p/4992"><a href="http://sachachua.com/blog/p/4992">http://sachachua.com/blog/p/4992</a></a>
</p>

<p>
/Reposted with permission because (a) it shows that people who aren't
computer geeks can also love Emacs, and (b) it gave me a warm and fuzzy
feeling and encouraged me to keep writing, so I want to keep it around
just in case I get in a rut again./
</p>

<blockquote>
<p>
Sacha,
</p>

<p>
I'm an emacs newbie who's trying to both simplify and empower my
computing life, and I've chosen emacs as the tool to do that. I'm
pretty excited about that, and overwhelmed, too.
</p>

<p>
Actually, a little background might help: I'm a PhD student in early
modern (read: renaissance) English literature. Yeah, I'm a Shakespeare
guy. I work in a field in which computers are, to most folks, MS Word,
MS Entourage, and MS Explorer. I'm a nut who actually plays with
stuff. (Actually, I don't tell my colleagues about it. It could
honestly damage my career. I know, it's disturbing.) I also have some
tech chops, being a refugee from the heady late 1990s tech boom where
I co-founded a small company that made some money before it collapsed.
I've been able to do the basics in emacs for years. The basics, but
nothing more.
</p>

<p>
My introduction this time was a rather circuitous route: I moved from
Mellel (on the Mac), to Scrivener where I discovered the wonders of
MultiMarkdown. Happily I discovered that I could use MMD and TextMate
to create LaTeX files without having to look at a bunch of distracting
LaTeX markup. I could write plain text and, with a couple of handy
keystrokes, create beautiful PDF files that my committee would
appreciate. The plain text files took up no space and could be edited
anywhere. I could fit a bazillion of them on my USB drive and carry
loads of research with me to my office on campus (where I got a
hand-me-down Dell running XP v.e.r.y.s.l.o.w.l.y) and on my much
speedier Mac at home and even in Linux. Neat. Still, MMD felt hack-y
and was only supported by one guy and I wondered if there was anything
else like it out there.
</p>

<p>
Which lead me to muse-mode. From there you can guess my path of
discovery: org-mode, planner-mode, remember: oh my!
</p>

<p>
For a prose writer like myself, the ability to have the cursor jump
forward and backward by letter, word, line, and paragraph was nothing
new, but M-a and M-e have changed my life. Why don't all word/text
processors understand that the sentence is the fundamental unit of
prose writing? Why don't they all allow me to navigate using units
that make logical sense?
</p>

<p>
Whoever said that emacs was for programmers only surely isn't a
writer.
</p>

<p>
(This is becoming much longer than I had anticipated, sorry.) My point
in writing is to tell you how invaluable I have found your two public
chapters (I think they're 7 and 8) have been for me. The whole idea of
writing a book about emacs as cool (as opposed to just highly
functional) is both obvious and revolutionary. Know that I would buy a
copy today if only it were available.
</p>

<p>
I noticed in your blog that you felt you had lost some steam on the
book. Please don't. My life is better, my writing is better, my
research is better, and, much to the joy of my wife, my progress
toward a completed PhD is better, all thanks to emacs which, based on
the tools I'm using, is also in thanks to you.
</p>

<p>
So thank you, and keep writing. I, for one, and hungry for more. I'm
sure others are, too.
</p>
</blockquote>

<p>
Jeffrey Windsor
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
